app/views/tasks/create.jbuilder

INSERT INTO "tasks" ("created_at", "updated_at", "content") VALUES (?, ?, ?)  [["created_at", "2020-05-11 21:28:13.858612"], ["updated_at", "2020-05-11 21:28:13.858612"], ["content", "New Task"]]
---
  json.completed  @task.completed
  json.created_at @task.created_at