app/views/tasks/update.jbuilder

UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2020-05-11 21:37:51.638617"], ["id", 1]]
---
  json.created_at @task.created_at
  json.updated_at @task.updated_at