app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "updated_at", "content") VALUES (?, ?, ?)  [["created_at", "2020-05-11 21:28:13.858612"], ["updated_at", "2020-05-11 21:28:13.858612"], ["content", "New Task"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @task = Task.find_by(id: params[:id])
    if @task and @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2020-05-11 21:28:14.129357"], ["id", 1]]
---
  def mark_complete
    @task = Task.find_by(id: params[:id])
    if @task and @task.update(completed: true)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 0], ["updated_at", "2020-05-11 21:37:51.698766"], ["id", 1]]
---
  def mark_active
    @task = Task.find_by(id: params[:id])
    if @task and @task.update(completed: false)